<?php


return[
    //===================================================================================
    // ATTACHMENTS=======================================================================
    //===================================================================================
    'attachment.add'=>'تم اضافة المرفق بنجاح',
    'attachment.delete'=>'تم حذف المرفق بنجاح',

    //===================================================================================
    // INVOICES==========================================================================
    //===================================================================================
    'invoices.add'=>'تم اضافة الفاتورة بنجاح',
    'invoices.edit'=>'تم تعديل الفاتورة بنجاح',
    'invoices.destroy'=>'تم حذف الفاتورة بنجاح',
    'invoices.archive'=>'تم أرشفة الفاتورة بنجاح',
    'invoices.recovery'=>'تم استعادة الفاتورة بنجاح',
    'invoices.add.notification'=>'تم اضافة الفاتورة بنجاح',
    'invoices.destroy.notification'=>'تم حذف فاتورة نهائيا بواسطة: ',
    'invoices.archive.notification'=>'تم أرشفة الفاتورة بواسطة: ',
    'invoice.add.message.subject'=>'تم اضافة فاتورة جديدة',
    'invoice.add.message.greeting'=>'مرحبا ',
    'invoice.add.message.line'=>'لقد قمت باضافة فاتورة جديدة بنجاح',
    'invoice.add.message.line.invoice_number'=>'رقم الفاتورة: #',
    'invoice.add.message.line.collection_amount'=>'اجمالي الفاتورة: ',
    'invoice.add.message.line.display'=>'عرض الفاتورة',
    'invoice.add.message.line.thinks'=>'شكرا لاستخدامك نظام محمد العجل',
    'invoice.add.message.line.salutation'=>'أطيب التحيات',

    //===================================================================================
    // PAYMENTS==========================================================================
    //===================================================================================
    'payments.change'=>'تم تغير حالة الفاتورة بنجاح',

    //===================================================================================
    // PRODUCTS==========================================================================
    //===================================================================================
    'product.add'=>'تم اضافة المعاملة بنجاح',
    'product.edit'=>'تم اضافة التعديلات بنجاح',
    'product.destroy'=>'تم حذف المعاملة بنجاح',

    //===================================================================================
    // PROFILE==========================================================================
    //===================================================================================
    'profile.edit'=>'تم تعديل البيانات بنجاح',

    //===================================================================================
    // ROLES=============================================================================
    //===================================================================================
    'role.add'=>'تم اضافة دور المستخدم بنجاح',
    'role.edit'=>'تم تعديل دور المستخدم بنجاح',
    'role.destroy'=>'تم حذف دور المستخدم بنجاح',

    //===================================================================================
    // SECTIONS==========================================================================
    //===================================================================================
    'section.add'=>'تم اضافة البنك بنجاح',
    'section.edit'=>'تم اضافة التعديلات على البنك بنجاح',
    'section.destroy'=>'تم حذف البنك بنجاح',

    //===================================================================================
    // USERS=============================================================================
    //===================================================================================
    'user.edit'=>'تم تعديل بيانات المستخدم بنجاح',
    'user.destroy'=>'تم حذف المستخدم بنجاح',
];
