<?php

return [
  'banks.transactions'=>'البنوك والمعاملات',
  'banks'=>'البنوك',
  'banks.list'=>'قائمة البنوك',
  'edit.bank'=>'تعديل بيانات البنك',
  'add.bank'=>'اضافة بنك جديد',
  'bank.name'=>'اسم البنك',
  'bank.description'=>'وصف البنك',
  'settings'=>'الاعدادات',
  'edit'=>'تعديل',
  'delete'=>'حذف',
  'cancel'=>'اغلاق',
  'add'=>'اضافة',


    //==============================================================================
    // MESSAGES=====================================================================
    //==============================================================================
    'delete.bank.confirm.message'=>'هل أنت متأكد من رغبتك في حذف هذا البنك نهائيا؟',
    'delete.bank.confirm.warning'=>'في حال حذفك لهذا البنك فبهذا سوف يتم حذف جميع معاملاته و فواتيره',

];
