<?php


return [
    'invoices'=>'الفواتير',
    'invoices.list'=>'قائمة الفواتير',
    'paid.invoices.list'=>'قائمة الفواتير المدفوعة',
    'unpaid.invoices.list'=>'قائمة الفواتير الغير مدفوعة',
    'partially.paid.invoices.list'=>'قائمة الفواتير المدفوعة جزئيا',
    'invoices.archive'=>'أرشيف الفواتير',
    'invoice.add'=>'اضافة فاتورة',
    'invoice.number'=>'رقم الفاتورة',
    'invoice.date'=>'تاريخ الفاتورة',
    'release.date'=>'تاريخ الاصدار',
    'due.date'=>'تاريخ الاستحقاق',
    'product'=>'المعاملة',
    'section'=>'البنك',
    'section.select'=>'اختر البنك',
    'discount'=>'الخصم',
    'rate.vat'=>'نسبة الضريبة',
    'value.vat'=>'قيمة الضريبة',
    'total'=>'الاجمالي',
    'status'=>'الحالة',
    'payment.status'=>'حالات دفع الفاتورة',
    'status.paid'=>'مدفوعة',
    'status.unpaid'=>'غير مدفوعة',
    'status.partially.paid'=>'مدفوعة جزئيا',
    'settings'=>'الاعدادات',
    'note'=>'الملاحظات',
    'invoice.edit'=>'تعديل الفاتورة',
    'invoice.archive'=>'أرشفة الفاتورة',
    'invoice.change.payment.status'=>'تغيير حالة الدفع',
    'invoice.print'=>'طباعة الفاتورة',
    'invoice.recovery'=>'استعادة الفاتورة',
    'invoice.delete'=>'حذف الفاتورة',
    'vat.rate'=>'نسبة ضريبة القيمة المضافة',
    'select.vat.rate'=>'حدد نسبة الضريبة',


    //==============================================================================
    // PRINT INVOICE================================================================
    //==============================================================================
    'invoice.print.show'=>'معاينة طباعة الفاتورة',
    'invoice.collection'=>'فاتورة تحصيل',
    'invoice.info'=>'معلومات الفاتورة',
    'collection.amount'=>'مبلغ التحصيل',
    'commission.amount'=>'مبلغ العمولة',
    'total.include.vat'=>'الاجمالي شامل الضريبة',
    'save.data'=>'حفظ البيانات',


    //==============================================================================
    // INVOICES DETAILS=============================================================
    //==============================================================================
    'invoice.details'=>'تفاصيل الفاتورة',
    'remaining.amount'=>'المبلغ المتبقي',
    'employee.name'=>'اسم الموظف',
    'paid.amount'=>'المبلغ المدفوع',
    'paid.notes'=>'ملاحظات الدفع',
    'paid.date'=>'تاريخ الدفع',
    'total.amount.requested'=>'اجمالي المبلغ المطلوب',
    'invoice.attachments'=>'مرفقات الفاتورة',
    'attachment extension'=>'* يجب ان يكون امتداد المرفق pdf, jpeg ,jpg , png',
    'attachment.name'=>'اسم المرفق',
    'attachments.add'=>'اضافة مرفقات',
    'select.attachment'=>'حدد المرفقات',
    'attachment.add'=>'اضافة المرفق',
    'add.by'=>'قام بالإصافة',
    'add.date'=>'تاريخ الإضافة',
    'display'=>'عرض',
    'download'=>'تحميل',
    'delete'=>'حذف',


    //==============================================================================
    // MESSAGES=====================================================================
    //==============================================================================
    'archive.invoice.confirm.message'=>'هل أنت متأكد من رغبتك في أرشفة هذه الفاتورة؟',
    'delete.invoice.confirm.message'=>'هل أنت متأكد من رغبتك في حذف هذه الفاتورة؟',
    'delete.attachment.confirm.message'=>'هل أنت متأكد من رغبتك في حذف هذا المرفق؟',
];
