<?php


return [
    'reports'=>'التقارير',
    'invoices.reports'=>'تقارير الفواتير',
    'customers.reports'=>'تقرير العملاء',
    'start.at'=>'من تاريخ',
    'end.at'=>'الى تاريخ',
    'search'=>'بحث',
    //==============================================================================
    // INVOICES REPORTS=============================================================
    //==============================================================================
    'search.invoice.type'=>'بحث بنوع الفاتورة',
    'search.invoice.number'=>'بحث برقم الفاتورة',
    'select.invoice.type'=>'تحديد نوع الفواتير',
    'all.invoices'=>'جميع الفواتير',
    'paid.invoices'=>'الفواتير المدفوعة',
    'unpaid.invoices'=>'الفواتير الغير مدفوعة',
    'partially.paid.invoices'=>'الفواتير المدفوعة جزئيا',
    'invoice.number'=>'رقم الفاتورة',
    //==============================================================================
    // CUSTOMERS REPORTS============================================================
    //==============================================================================
    'section'=>'البنك',
    'select.section'=>'حدد البنك',
    'product'=>'المعاملة',

];
