<?php

return [
  'banks.transactions'=>'البنوك والمعاملات',
  'transactions'=>'المعاملات',
  'bank'=>'البنك',
  'select.bank'=>'حدد البنك',
  'transactions.list'=>'قائمة المعاملات',
  'edit.transactions'=>'تعديل بيانات المعاملة',
  'add.transactions'=>'اضافة معاملة جديدة',
  'transactions.name'=>'اسم المعاملة',
  'transactions.description'=>'وصف المعاملة',
  'settings'=>'الاعدادات',
  'edit'=>'تعديل',
  'delete'=>'حذف',
  'cancel'=>'اغلاق',
  'add'=>'اضافة',


    //==============================================================================
    // MESSAGES=====================================================================
    //==============================================================================
    'delete.transactions.confirm.message'=>'هل أنت متأكد من رغبتك في حذف هذه المعاملة نهائيا؟',
];
