<?php


return [
    'users'=>'المستخدمين',
    'users.list'=>'قائمة المستخدمين',
    'user.info'=>'معلومات المستخدم',
    'user.edit'=>'تعديل بيانات المستخدم',
    'users.permissions'=>'صلاحيات المستخدمين',
    'display.permissions'=>'عرض الصلاحيات',
    'permissions'=>'الصلاحيات',
    'edit'=>'تعديل',
    'delete'=>'حذف',
    'save.data'=>'حفظ البيانات',
    'settings.btn'=>'الاعددات',
    'back'=>'عودة',
    'update'=>'تحديث',
    'cancel'=>'الغاء',
    //==============================================================================
    // USERS LIST===================================================================
    //==============================================================================
    'add.user'=>'اضافة مستخدم جديد',
    'user.name'=>'اسم المستخدم',
    'email'=>'البريد الالكتروني',
    'user.status'=>'حالة المستخدم',
    'user.role'=>'أدوار المستخدم',
    'active'=>'مفعل',
    'inactive'=>'غير مفعل',
    'delete.user'=>'حذف المستخدم',
    'password.change'=>'تغيير كلمة المرور',
    'confirm.new.password'=>'تأكيد كلمة المرور الجديدة',
    'profile.pic'=>'الصورة الشخصية',


    //==============================================================================
    // USERS PERMISSIONS============================================================
    //==============================================================================
    'add.permission'=>'اضافة صلاحية جديدة',
    'permission.name'=>'اسم الدور',
    'display'=>'عرض',
    'add.user.role'=>'اضافة دور جديد',
    //sidebar links
    'invoices'=>'الفواتير',
    'invoices-list'=>'قائمة الفواتير',
    'paid-invoices-list'=>'قائمة الفواتير المدفوعة',
    'partially-paid-invoices-list'=>'قائمة الفواتير المدفوعة جزئيا',
    'unpaid-invoices-list'=>'قائمة الفواتير الغير مدفوعة',
    'deleted-invoices-list'=>'أرشيف الفواتير',
    'reports'=>'التقارير',
    'invoices-reports'=>'تقارير الفواتير',
    'customer-reports'=>'تقارير العملاء',
    'users-list'=>'قائمة المستخدمين',
    'users-permissions'=>'صلاحيات المستخدمين',
    'settings'=>'البنوك و المعاملات',
    'products'=>'قائمة المعاملات',
    'sections'=>'قائمة البنوك',

    //invoices
    'add-invoice'=>'اضافة فاتورة جديدة',
    'invoice-details'=>'تفاصيل الفاتورة',
    'payment-change-status'=>'تغيير حالة الدفع',
    'edit-invoice'=>'تعديل الفاتورة',
    'soft-delete-invoice'=>'أرشفة الفاتورة',
    'print-invoice'=>'طباعة الفاتورة',
    'display-payment-status'=>'عرض حالات دفع الفاتورة',

    //attachments
    'add-attachment'=>'اضافة مرفق للفاتورة',
    'delete-attachment'=>'حذف مرفقات الفاتورة',
    'display-attachments'=>'عرض مرفقات الفاتورة',

    //deleted invoices
    'recover-invoice'=>'استعادة الفاتورة المؤرشفة',
    'delete-invoice'=>'حذف فاتورة',

    //users
    'add-user'=>'اضافة مستخدم جديد',
    'edit-user'=>'تعديل بيانات المستخدمين',
    'delete-user'=>'حذف مستخدم',

    //permissions
    'display-permission'=>'عرض صلاحيات المستخدمين',
    'add-permission'=>'اضافة صلاحسة جديدة',
    'edit-permission'=>'تعديل الصلاحيات',
    'delete-permission'=>'حذف صلاحية مستخدم',

    //products
    'add-product'=>'اضافة معاملة جديدة',
    'edit-product'=>'تعديل معلومات معاملة',
    'delete-product'=>'حذف معاملة',

    //sections
    'add-section'=>'اضافة بنك جديد',
    'edit-section'=>'تعديل بيانات البنوك',
    'delete-section'=>'حذف بنك',
    'notifications'=>'الاشعارات',


    //==============================================================================
    // MESSAGES=====================================================================
    //==============================================================================
    'delete.role.confirm.message'=>'هل أنت متأكد من رغبتك في حذف هذا الدور نهائيا؟',
    'delete.user.confirm.message'=>'هل أنت متأكد من رغبتك في حذف هذا المستخدم نهائيا؟',
    'delete.role.confirm.warning'=>'بمجرد حذفك لهذا الدور لن تتمكن من الرجوع عن الحذف نهائيا',
];
